Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/include/pic32ck1025sg01100.h
/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CK1025SG01100                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x45012000)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x45010000)                          /* ADC Base Address */
#define CAN0_BASE_ADDRESS                _UINT32_(0x4501e000)                          /* CAN0 Base Address */
#define CAN1_BASE_ADDRESS                _UINT32_(0x45020000)                          /* CAN1 Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x4501a000)                          /* CCL Base Address */
#define CMCC_BASE_ADDRESS                _UINT32_(0x44808000)                          /* CMCC Base Address */
#define DMA0_BASE_ADDRESS                _UINT32_(0x44802000)                          /* DMA0 Base Address */
#define DMA1_BASE_ADDRESS                _UINT32_(0x44804000)                          /* DMA1 Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* DSU Base Address */
#define EBI_BASE_ADDRESS                 _UINT32_(0x4502c000)                          /* EBI Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x4401a000)                          /* EIC Base Address */
#define EIC_SEC_BASE_ADDRESS             _UINT32_(0x4401b000)                          /* EIC Base Address */
#define ETH_BASE_ADDRESS                 _UINT32_(0x45022000)                          /* ETH Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x4480e000)                          /* EVSYS Base Address */
#define FCR_BASE_ADDRESS                 _UINT32_(0x44002000)                          /* FCR Base Address */
#define FCW_BASE_ADDRESS                 _UINT32_(0x44004000)                          /* FCW Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x44014000)                          /* FREQM Base Address */
#define FUSES_BOOTCFG1_BASE_ADDRESS      _UINT32_(0x0a002000)                          /* FUSES Base Address */
#define FUSES_BOOTCFG2_BASE_ADDRESS      _UINT32_(0x0a00a000)                          /* FUSES Base Address */
#define FUSES_DALCFG_BASE_ADDRESS        _UINT32_(0x0a004000)                          /* FUSES Base Address */
#define FUSES_USERCFG1_BASE_ADDRESS      _UINT32_(0x0a000000)                          /* FUSES Base Address */
#define FUSES_USERCFG2_BASE_ADDRESS      _UINT32_(0x0a008000)                          /* FUSES Base Address */
#define FUSES_CALOTP_BASE_ADDRESS        _UINT32_(0x0a007000)                          /* FUSES Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x44010000)                          /* GCLK Base Address */
#define HMATRIX_BASE_ADDRESS             _UINT32_(0x44806000)                          /* HMATRIX Base Address */
#define HSM_BASE_ADDRESS                 _UINT32_(0x48000000)                          /* HSM Base Address */
#define IDAU_BASE_ADDRESS                _UINT32_(0x4480c000)                          /* IDAU Base Address */
#define MCLK_BASE_ADDRESS                _UINT32_(0x44012000)                          /* MCLK Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UINT32_(0x4400e000)                          /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UINT32_(0x4400c000)                          /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x4401c000)                          /* PAC Base Address */
#define PCC_BASE_ADDRESS                 _UINT32_(0x45018000)                          /* PCC Base Address */
#define PDEC_BASE_ADDRESS                _UINT32_(0x4501c000)                          /* PDEC Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x44006000)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x44800000)                          /* PORT Base Address */
#define PORT_SEC_BASE_ADDRESS            _UINT32_(0x44801000)                          /* PORT Base Address */
#define PRM_BASE_ADDRESS                 _UINT32_(0x4480a000)                          /* PRM Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x45014000)                          /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x4400a000)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x44018000)                          /* RTC Base Address */
#define SDMMC0_BASE_ADDRESS              _UINT32_(0x45026000)                          /* SDMMC0 Base Address */
#define SDMMC1_BASE_ADDRESS              _UINT32_(0x45028000)                          /* SDMMC1 Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x44810000)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x44812000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x44814000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x44816000)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x45000000)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x45002000)                          /* SERCOM5 Base Address */
#define SERCOM6_BASE_ADDRESS             _UINT32_(0x45004000)                          /* SERCOM6 Base Address */
#define SERCOM7_BASE_ADDRESS             _UINT32_(0x45006000)                          /* SERCOM7 Base Address */
#define SIG_BASE_ADDRESS                 _UINT32_(0xe000ef00)                          /* SIG Base Address */
#define SIG_NS_BASE_ADDRESS              _UINT32_(0xe002ef00)                          /* SIG_NS Base Address */
#define SPI_IXS_BASE_ADDRESS             _UINT32_(0x45016000)                          /* SPI_IXS Base Address */
#define SQI_BASE_ADDRESS                 _UINT32_(0x0ffff000)                          /* SQI Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x44008000)                          /* SUPC Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x44818000)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x4481a000)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x4481c000)                          /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UINT32_(0x4481e000)                          /* TCC3 Base Address */
#define TCC4_BASE_ADDRESS                _UINT32_(0x45008000)                          /* TCC4 Base Address */
#define TCC5_BASE_ADDRESS                _UINT32_(0x4500a000)                          /* TCC5 Base Address */
#define TCC6_BASE_ADDRESS                _UINT32_(0x4500c000)                          /* TCC6 Base Address */
#define TCC7_BASE_ADDRESS                _UINT32_(0x4500e000)                          /* TCC7 Base Address */
#define TRAM_BASE_ADDRESS                _UINT32_(0x4401e000)                          /* TRAM Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x45024000)                          /* TRNG Base Address */
#define USB_BASE_ADDRESS                 _UINT32_(0x4502a000)                          /* USB Base Address */
#define USBHS_BASE_ADDRESS               _UINT32_(0x46000000)                          /* USBHS Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44016000)                          /* WDT Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CK1025SG01100                                   */
/* ************************************************************************** */
#include "pio/pic32ck1025sg01100.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CK1025SG01100                        */
/* ************************************************************************** */
#define CMCC_DATARAM_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: ram */
#define CMCC_TAGRAM_SIZE               _UINT32_(0x00000400)    /*    1kB Memory segment type: ram */
#define CMCC_VALIDRAM_SIZE             _UINT32_(0x00000040)    /*    0kB Memory segment type: ram */
#define PRM_ROM_SIZE                   _UINT32_(0x00008000)    /*   32kB Memory segment type: rom */
#define FLASH_BFM_SIZE                 _UINT32_(0x00020000)    /*  128kB Memory segment type: flash */
#define FLASH_BFM_PAGE_SIZE            _UINT32_(      4096)
#define FLASH_BFM_NB_OF_PAGES          _UINT32_(        32)

